{
  "about": [
    "Hi there, I am Leander. I have been working with web development for over seven years, developing intuitive solutions that last long and are easy to extend.",
    "",
    "I believe that focusing on your goals and hearing what you have to say is key to a successful partnership. So is flexibility to go the extra mile.",
    "After all, you are unique - just like your projects.",
    "",
    "I was born in Brazil but have since already traveled around the globe, never missing the chance to learn something new.",
    "Ever since school I have enjoyed solving problems in creative ways. Exploring new ideas and places",
    "keeps me going, as by doing so I always find new inspirations in nature and in people. This is what I try to bring to my work.",
    "",
    "It's with inspiration, passion and technical expertise that I hope to make your digital presence a truly remarkable one.",
    "",
    "Let's get started!"
  ],
  "experiences": [{
    "id": "integritas",
    "company": {
      "name": "Integritas",
      "location": "Remote",
      "logo": "integritas-logo.png"
    },
    "start": "Feb 2020",
    "end": "current",
    "title": "Software Engineer",
    "summary": [
      "Working for an outsourcing company, I already had the chance to help two clients from very distinct industries: energy and banking.",
      "",
      "The first client required expertise in the React ecosystem to expand and improve their data visualization platform, with a focus on performance due to the huge amount of data.",
      "",
      "The second one benefits from my JavaScript and Java skills to develop new services using Temenos’ Kony platform."
    ]
  }, {
    "id": "nomadmacaw",
    "company": {
      "name": "Nomad Macaw",
      "location": "Remote",
      "logo": "nomadmacaw-logo.png"
    },
    "start": "August 2019",
    "end": "February 2020",
    "title": "Freelancer",
    "summary": [
      "Worked on smaller projects which were a match with skills I was improving - namely, UI and UX design, - or I just felt like working.",
      "",
      "Projects:",
      "- Brand identity, logo and website design and implementation for a car repair shop, using Affinity - Designer, React and Node;",
      "- Node and JavaScript pro bono consulting for a company seeking to build their own e-learning platform;",
      "- General systems design pro bono consultancy for a community of readers and writers, including innovative storyline tools."
    ]
  },{
    "id": "stuff",
    "company": {
      "name": "Stuff",
      "location": "Auckland, New Zealand",
      "logo": "stuff-logo.png"
    },
    "start": "Sep 2017",
    "end": "Aug 2018",
    "title": "Fullstack Engineer",
    "summary": [
      "Assigned to the Commerce department, I help in maintaining and evolving products such as indexed.co.nz and popshop.stuff.co.nz, as well as bootstrapping or rewriting websites for partnerships such as donehealthcovered.co.nz and energyclubnz.com.",
      "",
      "ReactJS is heavily used on the frontend while the backend is written in NodeJS with ExpressJS and GraphQL. For maintaining our internal commerce APIs however, I use Ruby on Rails and EmberJS.",
      "My responsibilities range from architectural decisions during conception phase to deployment and maintenance with proper CI/CD.",
      "",
      "I pride myself in having upskilled in React, the AWS environment and other tools required for the success of the product in relatively short time frames. This adaptability, I believe, is key to creating great projects and maintaining a good relationship with my peers in an environment that is constantly evolving."
    ],
    "projects": [{
      "name": "Indexed",
      "link": "https://indexed.co.nz",
      "thumbnail": "projects/indexed.jpg"
    }, {
      "name": "PopShop",
      "link": "https://popshop.stuff.co.nz",
      "thumbnail": "projects/popshop.jpg"
    }, {
      "name": "Done",
      "link": "https://donehealthcovered.co.nz",
      "thumbnail": "projects/donehealth.jpg"
    }],
    "skills": ["JavaScript", "Node.js", "Webpack", "Sass", "PostgreSQL", "Ruby", "Ruby on Rails", "Amazon Web Services"]
  }, {
    "id": "hbsis",
    "company": {
      "name": "HBSIS",
      "location": "Blumenau, Brazil",
      "logo": "hbsis-logo.png"
    },
    "start": "May 2016",
    "end": "May 2017",
    "title": "Software Engineer",
    "summary": [
      "I worked on client specific demands based on the web. I was often responsible for developing the front-end of the solution using AngularJS, Gulp, Bower and sometimes Node.js for mock-ups.",
      "I also worked on the back-end - usually implemented using Java Spring Boot and NoSql (MongoDB).",
      "",
      "Being close to the R&D department, I also got in touch with other technologies, like Akka and Facebook Graph API."
    ]
  }, {
    "id": "philips",
    "company": {
      "name": "Philips Healthcare",
      "location": "Blumenau, Brazil",
      "logo": "philips-logo.png"
    },
    "start": "Feb 2015",
    "end": "Feb 2016",
    "title": "Software Engineer",
    "summary": [
      "At Philips I worked at the Technology department. As my most significant attributions, I:",
      "- developed new components to extend the new HTML5 framework being used to support the migration of Tasy's existing functions, first in GWT and then in AngularJS;",
      "- researched technological improvements;",
      "- aided developers in following architectural standards and problem solving;",
      "- led developers on the development of new features and bug fixes;",
      "- represented the framework team to a Bangalore based team, fixing bugs, clearing up doubts and reporting status.",
      "",
      "I worked as a full-stack developer, respecting the existing server architecture in order not to break compatibility with the old platform and respecting the Philips Design specifications with regard to user experience.",
      "",
      "In our team we kept documentation up-to-date as we developed new features or fixed existing ones, both in JavaDoc and in an internal Wiki.",
      "I also helped the team in the adoption of TDD with my past experiences and research.",
      "We followed the Scaled Agile Framework (SAFe) in the development of this new platform.",
      "",
      "With this experience I've also expanded my skills at dealing with different people, leading other developers and software engineering itself."
    ],
    "projects": [{
      "name": "Tasy HTML5",
      "link": "https://www.philips.com.au/healthcare/resources/landing/tasy",
      "thumbnail": "projects/tasy-html5.jpg"
    }]
  }, {
    "id": "senior",
    "company": {
      "name": "Senior Sistemas",
      "location": "Blumenau, Brazil",
      "logo": "senior-logo.png"
    },
    "start": "Jan 2012",
    "end": "Feb 2015",
    "title": "Java and C# Developer",
    "summary": [
      "In my first professional experience, I:",
      "- Assisted in the migration of a product from Delphi to Java.",
      "- Also worked maintaining an internal JEE framework, having worked a lot with memory consume optimization.",
      "- Development and maintenance of an internal framework, covering visual layer (web: JavaScript, HTML and CSS), persistence layer, plugin development for the Eclipse platform, JEE, optimizations and test automation for browsers and Eclipse.",
      "- Maintenance and improvement of a middleware for communication of digital fiscal documents between Senior solutions and the Federal and Municipal government.",
      "- Development with C# and ASP."
    ]
  }],
  "testimonials": [{
    "author": "Caique Caleiro",
    "relationship": "Co-worker at Philips",
    "message": "Leander is a great professional that is always trying to improve his knowlegde. It's very nice to work with him, because he is able to deal with any problem and has great skills in problem solving.\nHe is keen on new technologies and always try to share his willingness with the team."
  }, {
    "author": "Julio Gesser",
    "relationship": "Software Architect at Senior",
    "message": "Leander is a very commited and very smart professional. He always gave his best to solve the problems and he is always concerned with the quality and performance of the code.\nLeander learns fast and has a brilliant career ahead."
  }],
  "contact": {
    "phone": "+55 47 99283 8693",
    "mail": "leander@nomadmacaw.com",
    "post": "/todo-mail",
    "linkedin": "https://linkedin.com/in/leanseefeld",
    "github": "https://github.com/leanseefeld"
  }
}